api/app/controllers/todos_controller.rb

    def update
        todo = user.todos.find(params[:id]).update(todo_params)
---
SELECT "todos".* FROM "todos" WHERE "todos"."user_id" = ? AND "todos"."id" = ? LIMIT ?  [["user_id", 2], ["id", 1], ["LIMIT", 1]]
UPDATE "todos" SET "title" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["title", "Add Update endpoints"], ["updated_at", "2023-03-23 09:53:50.318853"], ["id", 1]]